const city = require('../../utils/city.js');
Page({
    data:{
    	list : [],
        citylist: [{"f":12,"u":0.5,"e":8,"b":0,"s":"安庆","n":"安徽","m":2,"i":0,"money":"4925","initial":"A"},{"f":12,"u":0.5,"e":8,"b":0,"s":"蚌埠","n":"安徽","m":2,"i":0,"money":"4925","initial":"B"},{"f":20,"u":0.5,"e":8,"b":0,"s":"亳州","n":"安徽","m":2,"i":0,"money":"4925","initial":"H"},{"f":20,"u":1,"e":8,"b":0,"s":"池州","n":"安徽","m":2,"i":0,"money":"4925","initial":"C"},{"f":20,"u":1,"e":8,"b":0,"s":"滁州","n":"安徽","m":2,"i":0,"money":"4925","initial":"C"},{"f":12,"u":0.5,"e":8,"b":0,"s":"阜阳","n":"安徽","m":2,"i":0,"money":"4925","initial":"F"},{"f":12,"u":0.5,"e":8,"b":0,"s":"合肥","n":"安徽","m":2,"i":0,"money":"4925","initial":"H"},{"f":12,"u":0.5,"e":8,"b":0,"s":"淮南","n":"安徽","m":2,"i":0,"money":"4925","initial":"H"},{"f":20,"u":1,"e":8,"b":0,"s":"黄山","n":"安徽","m":2,"i":0,"money":"4925","initial":"H"},{"f":20,"u":1,"e":8,"b":0,"s":"六安","n":"安徽","m":2,"i":0,"money":"4925","initial":"L"},{"f":20,"u":0.5,"e":8,"b":0,"s":"马鞍山","n":"安徽","m":2,"i":0,"money":"4925","initial":"M"},{"f":20,"u":1,"e":8,"b":0,"s":"宿州","n":"安徽","m":2,"i":0,"money":"4925","initial":"S"},{"f":18,"u":1,"e":8,"b":0,"s":"铜陵","n":"安徽","m":2,"i":0,"money":"4925","initial":"T"},{"f":20,"u":0.5,"e":8,"b":0,"s":"芜湖","n":"安徽","m":2,"i":0,"money":"4925","initial":"W"},{"f":12,"u":0.2,"e":8,"b":0,"s":"北京","n":"北京","m":2,"i":0,"money":"9994","initial":"B"},{"f":5,"u":0.5,"e":8,"b":0,"s":"福州","n":"福建","m":2,"i":0,"money":"5164","initial":"F"},{"f":5,"u":0.5,"e":8,"b":0,"s":"龙岩","n":"福建","m":2,"i":0,"money":"5164","initial":"L"},{"f":15,"u":0.5,"e":8,"b":0,"s":"厦门","n":"福建","m":2,"i":0,"money":"5164","initial":"X"},{"f":15,"u":0.5,"e":8,"b":0,"s":"漳州","n":"福建","m":2,"i":0,"money":"5164","initial":"Z"},{"f":5,"u":0.5,"e":8,"b":0,"s":"南平","n":"福建","m":2,"i":0,"money":"5164","initial":"N"},{"f":5,"u":0.5,"e":8,"b":0,"s":"宁德","n":"福建","m":2,"i":0,"money":"5164","initial":"N"},{"f":5,"u":0.5,"e":8,"b":0,"s":"莆田","n":"福建","m":2,"i":0,"money":"5164","initial":"P"},{"f":5,"u":0.5,"e":8,"b":0,"s":"泉州","n":"福建","m":2,"i":0,"money":"5164","initial":"Q"},{"f":5,"u":0.5,"e":8,"b":0,"s":"三明","n":"福建","m":2,"i":0,"money":"5164","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"庆阳","n":"甘肃","m":2,"i":0,"money":"4798","initial":"Q"},{"f":12,"u":1,"e":8,"b":0,"s":"平凉","n":"甘肃","m":2,"i":0,"money":"4798","initial":"P"},{"f":12,"u":0.5,"e":8,"b":0,"s":"天水","n":"甘肃","m":2,"i":0,"money":"4798","initial":"T"},{"f":12,"u":0.5,"e":8,"b":0,"s":"张掖","n":"甘肃","m":2,"i":0,"money":"4798","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"武威","n":"甘肃","m":2,"i":0,"money":"4798","initial":"W"},{"f":12,"u":0.5,"e":8,"b":0,"s":"陇南","n":"甘肃","m":2,"i":0,"money":"4798","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"兰州","n":"甘肃","m":2,"i":0,"money":"4798","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"嘉峪关","n":"甘肃","m":2,"i":0,"money":"4798","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"金昌","n":"甘肃","m":2,"i":0,"money":"4798","initial":"J"},{"f":12,"u":1,"e":8,"b":0,"s":"酒泉","n":"甘肃","m":2,"i":0,"money":"4798","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"定西","n":"甘肃","m":2,"i":0,"money":"4798","initial":"D"},{"f":12,"u":0.5,"e":8,"b":0,"s":"白银","n":"甘肃","m":2,"i":0,"money":"4798","initial":"B"},{"f":12,"u":0.5,"e":8,"b":0,"s":"潮州","n":"广东","m":2,"i":0,"money":"6027","initial":"C"},{"f":12,"u":0.5,"e":8,"b":0,"s":"东莞","n":"广东","m":2,"i":0,"money":"6027","initial":"D"},{"f":12,"u":0.5,"e":8,"b":0,"s":"佛山","n":"广东","m":2,"i":0,"money":"6027","initial":"F"},{"f":12,"u":0.5,"e":8,"b":0,"s":"广州","n":"广东","m":2,"i":0,"money":"6027","initial":"G"},{"f":12,"u":0.5,"e":8,"b":0,"s":"揭阳","n":"广东","m":2,"i":0,"money":"6027","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"江门","n":"广东","m":2,"i":0,"money":"6027","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"惠州","n":"广东","m":2,"i":0,"money":"6027","initial":"H"},{"f":12,"u":0.5,"e":8,"b":0,"s":"河源","n":"广东","m":2,"i":0,"money":"6027","initial":"H"},{"f":12,"u":0.5,"e":8,"b":0,"s":"茂名","n":"广东","m":2,"i":0,"money":"6027","initial":"M"},{"f":12,"u":0.5,"e":8,"b":0,"s":"梅州","n":"广东","m":2,"i":0,"money":"6027","initial":"M"},{"f":12,"u":0.5,"e":8,"b":0,"s":"阳江","n":"广东","m":2,"i":0,"money":"6027","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"湛江","n":"广东","m":2,"i":0,"money":"6027","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"肇庆","n":"广东","m":2,"i":0,"money":"6027","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"云浮","n":"广东","m":2,"i":0,"money":"6027","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"中山","n":"广东","m":2,"i":0,"money":"6027","initial":"Z"},{"f":12,"u":0.2,"e":8,"b":0,"s":"珠海","n":"广东","m":2,"i":0,"money":"6027","initial":"Z"},{"f":12,"u":1,"e":8,"b":0,"s":"深圳","n":"广东","m":2,"i":0,"money":"6027","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"清远","n":"广东","m":2,"i":0,"money":"6027","initial":"Q"},{"f":12,"u":0.5,"e":8,"b":0,"s":"汕头","n":"广东","m":2,"i":0,"money":"6027","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"汕尾","n":"广东","m":2,"i":0,"money":"6027","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"韶关","n":"广东","m":2,"i":0,"money":"6027","initial":"S"},{"f":5,"u":0.5,"e":8,"b":0,"s":"钦州","n":"广西","m":2,"i":0,"money":"4823","initial":"Q"},{"f":12,"u":0.5,"e":8,"b":0,"s":"南宁","n":"广西","m":2,"i":0,"money":"4823","initial":"N"},{"f":5,"u":0.5,"e":8,"b":0,"s":"玉林","n":"广西","m":2,"i":0,"money":"4823","initial":"Y"},{"f":5,"u":0.5,"e":8,"b":0,"s":"梧州","n":"广西","m":2,"i":0,"money":"4823","initial":"W"},{"f":5,"u":0.5,"e":8,"b":0,"s":"柳州","n":"广西","m":2,"i":0,"money":"4823","initial":"L"},{"f":5,"u":0.5,"e":8,"b":0,"s":"来宾","n":"广西","m":2,"i":0,"money":"4823","initial":"L"},{"f":5,"u":0.5,"e":8,"b":0,"s":"贵港","n":"广西","m":2,"i":0,"money":"4823","initial":"G"},{"f":5,"u":0.5,"e":8,"b":0,"s":"河池","n":"广西","m":2,"i":0,"money":"4823","initial":"H"},{"f":5,"u":0.5,"e":8,"b":0,"s":"桂林","n":"广西","m":2,"i":0,"money":"4823","initial":"G"},{"f":5,"u":0.5,"e":8,"b":0,"s":"贺州","n":"广西","m":2,"i":0,"money":"4823","initial":"H"},{"f":5,"u":0.5,"e":8,"b":0,"s":"防城港","n":"广西","m":2,"i":0,"money":"4823","initial":"F"},{"f":5,"u":0.5,"e":8,"b":0,"s":"崇左","n":"广西","m":2,"i":0,"money":"4823","initial":"C"},{"f":5,"u":0.5,"e":8,"b":0,"s":"百色","n":"广西","m":2,"i":0,"money":"4823","initial":"B"},{"f":8,"u":0.5,"e":8,"b":0,"s":"北海","n":"广西","m":2,"i":0,"money":"4823","initial":"B"},{"f":12,"u":0.5,"e":8,"b":0,"s":"安顺","n":"贵州","m":2,"i":0,"money":"5523","initial":"A"},{"f":12,"u":0.5,"e":8,"b":0,"s":"贵阳","n":"贵州","m":2,"i":0,"money":"5523","initial":"G"},{"f":12,"u":0.5,"e":8,"b":0,"s":"六盘水","n":"贵州","m":2,"i":0,"money":"5523","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"遵义","n":"贵州","m":2,"i":0,"money":"5523","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"三亚","n":"海南","m":2,"i":0,"money":"5139","initial":"S"},{"f":12,"u":1,"e":8,"b":0,"s":"海口","n":"海南","m":2,"i":0,"money":"5139","initial":"H"},{"f":8,"u":0.5,"e":8,"b":0,"s":"邯郸","n":"河北","m":2,"i":0,"money":"4611","initial":"H"},{"f":20,"u":0.5,"e":8,"b":0,"s":"保定","n":"河北","m":2,"i":0,"money":"4611","initial":"B"},{"f":20,"u":0.5,"e":8,"b":0,"s":"承德","n":"河北","m":2,"i":0,"money":"4611","initial":"C"},{"f":20,"u":0.5,"e":8,"b":0,"s":"沧州","n":"河北","m":2,"i":0,"money":"4611","initial":"C"},{"f":20,"u":0.5,"e":8,"b":0,"s":"廊坊","n":"河北","m":2,"i":0,"money":"4611","initial":"L"},{"f":20,"u":0.5,"e":8,"b":0,"s":"衡水","n":"河北","m":2,"i":0,"money":"4611","initial":"H"},{"f":20,"u":0.5,"e":8,"b":0,"s":"秦皇岛","n":"河北","m":2,"i":0,"money":"4611","initial":"Q"},{"f":20,"u":0.5,"e":8,"b":0,"s":"石家庄","n":"河北","m":2,"i":0,"money":"4611","initial":"S"},{"f":20,"u":0.5,"e":8,"b":0,"s":"唐山","n":"河北","m":2,"i":0,"money":"4611","initial":"T"},{"f":20,"u":0.5,"e":8,"b":0,"s":"张家口","n":"河北","m":2,"i":0,"money":"4611","initial":"Z"},{"f":6,"u":1,"e":8,"b":0,"s":"邢台","n":"河北","m":2,"i":0,"money":"4611","initial":"X"},{"f":12,"u":0.5,"e":8,"b":0,"s":"信阳","n":"河南","m":2,"i":0,"money":"4125","initial":"X"},{"f":12,"u":0.5,"e":8,"b":0,"s":"新乡","n":"河南","m":2,"i":0,"money":"4125","initial":"X"},{"f":12,"u":0.5,"e":8,"b":0,"s":"许昌","n":"河南","m":2,"i":0,"money":"4125","initial":"X"},{"f":12,"u":0.5,"e":8,"b":0,"s":"驻马店","n":"河南","m":2,"i":0,"money":"4125","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"周口","n":"河南","m":2,"i":0,"money":"4125","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"郑州","n":"河南","m":2,"i":0,"money":"4125","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"三门峡","n":"河南","m":2,"i":0,"money":"4125","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"商丘","n":"河南","m":2,"i":0,"money":"4125","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"南阳","n":"河南","m":2,"i":0,"money":"4125","initial":"N"},{"f":12,"u":0.5,"e":8,"b":0,"s":"平顶山","n":"河南","m":2,"i":0,"money":"4125","initial":"P"},{"f":12,"u":0.5,"e":8,"b":0,"s":"濮阳","n":"河南","m":2,"i":0,"money":"4125","initial":"P"},{"f":12,"u":0.5,"e":8,"b":0,"s":"焦作","n":"河南","m":2,"i":0,"money":"4125","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"开封","n":"河南","m":2,"i":0,"money":"4125","initial":"K"},{"f":15,"u":0.5,"e":8,"b":0,"s":"洛阳","n":"河南","m":2,"i":0,"money":"4125","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"漯河","n":"河南","m":2,"i":0,"money":"4125","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"安阳","n":"河南","m":2,"i":0,"money":"4125","initial":"A"},{"f":12,"u":0.5,"e":8,"b":0,"s":"鹤壁","n":"河南","m":2,"i":0,"money":"4125","initial":"H"},{"f":8,"u":0.5,"e":8,"b":0,"s":"鹤岗","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"H"},{"f":8,"u":0.5,"e":8,"b":0,"s":"黑河","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"H"},{"f":8,"u":0.5,"e":8,"b":0,"s":"哈尔滨","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"H"},{"f":8,"u":0.5,"e":8,"b":0,"s":"大庆","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"D"},{"f":12,"u":1,"e":8,"b":0,"s":"牡丹江","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"M"},{"f":8,"u":0.5,"e":8,"b":0,"s":"佳木斯","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"J"},{"f":8,"u":0.5,"e":8,"b":0,"s":"鸡西","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"J"},{"f":8,"u":0.5,"e":8,"b":0,"s":"七台河","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"Q"},{"f":8,"u":0.5,"e":8,"b":0,"s":"齐齐哈尔","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"Q"},{"f":8,"u":0.5,"e":8,"b":0,"s":"双鸭山","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"S"},{"f":8,"u":0.5,"e":8,"b":0,"s":"绥化","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"S"},{"f":8,"u":0.5,"e":8,"b":0,"s":"伊春","n":"黑龙江","m":2,"i":0,"money":"4370","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"宜昌","n":"湖北","m":2,"i":0,"money":"4986","initial":"Y"},{"f":8,"u":1.5,"e":8,"b":0,"s":"襄樊","n":"湖北","m":2,"i":0,"money":"4986","initial":"X"},{"f":8,"u":1.5,"e":8,"b":0,"s":"孝感","n":"湖北","m":2,"i":0,"money":"4986","initial":"X"},{"f":8,"u":1.5,"e":8,"b":0,"s":"武汉","n":"湖北","m":2,"i":0,"money":"4986","initial":"W"},{"f":12,"u":0.5,"e":8,"b":0,"s":"咸宁","n":"湖北","m":2,"i":0,"money":"4986","initial":"X"},{"f":8,"u":1.5,"e":8,"b":0,"s":"随州","n":"湖北","m":2,"i":0,"money":"4986","initial":"S"},{"f":12,"u":1,"e":8,"b":0,"s":"十堰","n":"湖北","m":2,"i":0,"money":"4986","initial":"S"},{"f":8,"u":1.5,"e":8,"b":0,"s":"黄石","n":"湖北","m":2,"i":0,"money":"4986","initial":"H"},{"f":8,"u":1.5,"e":8,"b":0,"s":"黄冈","n":"湖北","m":2,"i":0,"money":"4986","initial":"H"},{"f":12,"u":0.5,"e":8,"b":0,"s":"荆门","n":"湖北","m":2,"i":0,"money":"4986","initial":"J"},{"f":8,"u":1.5,"e":8,"b":0,"s":"荆州","n":"湖北","m":2,"i":0,"money":"4986","initial":"J"},{"f":8,"u":1.5,"e":8,"b":0,"s":"鄂州","n":"湖北","m":2,"i":0,"money":"4986","initial":"E"},{"f":12,"u":0.7,"e":8,"b":0,"s":"长沙","n":"湖南","m":2,"i":0,"money":"4853","initial":"C"},{"f":12,"u":0.7,"e":8,"b":0,"s":"郴州","n":"湖南","m":2,"i":0,"money":"4853","initial":"C"},{"f":12,"u":0.7,"e":8,"b":0,"s":"常德","n":"湖南","m":2,"i":0,"money":"4853","initial":"C"},{"f":12,"u":0.7,"e":8,"b":0,"s":"衡阳","n":"湖南","m":2,"i":0,"money":"4853","initial":"H"},{"f":12,"u":0.7,"e":8,"b":0,"s":"怀化","n":"湖南","m":2,"i":0,"money":"4853","initial":"H"},{"f":12,"u":0.7,"e":8,"b":0,"s":"娄底","n":"湖南","m":2,"i":0,"money":"4853","initial":"L"},{"f":12,"u":0.7,"e":8,"b":0,"s":"邵阳","n":"湖南","m":2,"i":0,"money":"4853","initial":"S"},{"f":12,"u":0.7,"e":8,"b":0,"s":"湘潭","n":"湖南","m":2,"i":0,"money":"4853","initial":"X"},{"f":12,"u":0.7,"e":8,"b":0,"s":"益阳","n":"湖南","m":2,"i":0,"money":"4853","initial":"Y"},{"f":12,"u":0.7,"e":8,"b":0,"s":"株洲","n":"湖南","m":2,"i":0,"money":"4853","initial":"Z"},{"f":12,"u":0.7,"e":8,"b":0,"s":"张家界","n":"湖南","m":2,"i":0,"money":"4853","initial":"Z"},{"f":12,"u":1,"e":8,"b":0,"s":"永州","n":"湖南","m":2,"i":0,"money":"4853","initial":"Y"},{"f":12,"u":0.7,"e":8,"b":0,"s":"岳阳","n":"湖南","m":2,"i":0,"money":"4853","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"四平","n":"吉林","m":2,"i":0,"money":"4675","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"松原","n":"吉林","m":2,"i":0,"money":"4675","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"通化","n":"吉林","m":2,"i":0,"money":"4675","initial":"T"},{"f":12,"u":0.5,"e":8,"b":0,"s":"辽源","n":"吉林","m":2,"i":0,"money":"4675","initial":"L"},{"f":12,"u":1,"e":8,"b":0,"s":"吉林","n":"吉林","m":2,"i":0,"money":"4675","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"长春","n":"吉林","m":2,"i":0,"money":"4675","initial":"C"},{"f":12,"u":0.5,"e":8,"b":0,"s":"白城","n":"吉林","m":2,"i":0,"money":"4675","initial":"B"},{"f":12,"u":0.5,"e":8,"b":0,"s":"白山","n":"吉林","m":2,"i":0,"money":"4675","initial":"B"},{"f":8,"u":0.5,"e":8,"b":0,"s":"常州","n":"江苏","m":2,"i":0,"money":"5965","initial":"C"},{"f":8,"u":0.5,"e":8,"b":0,"s":"淮安","n":"江苏","m":2,"i":0,"money":"5965","initial":"H"},{"f":8,"u":0.5,"e":8,"b":0,"s":"连云港","n":"江苏","m":2,"i":0,"money":"5965","initial":"L"},{"f":8,"u":0.5,"e":8,"b":0,"s":"无锡","n":"江苏","m":2,"i":0,"money":"5965","initial":"W"},{"f":8,"u":0.5,"e":8,"b":0,"s":"苏州","n":"江苏","m":2,"i":0,"money":"5965","initial":"S"},{"f":8,"u":0.5,"e":8,"b":0,"s":"宿迁","n":"江苏","m":2,"i":0,"money":"5965","initial":"S"},{"f":8,"u":0.5,"e":8,"b":0,"s":"南京","n":"江苏","m":2,"i":0,"money":"5965","initial":"N"},{"f":8,"u":0.5,"e":8,"b":0,"s":"南通","n":"江苏","m":2,"i":0,"money":"5965","initial":"N"},{"f":8,"u":0.5,"e":8,"b":0,"s":"镇江","n":"江苏","m":2,"i":0,"money":"5965","initial":"Z"},{"f":8,"u":0.5,"e":8,"b":0,"s":"盐城","n":"江苏","m":2,"i":0,"money":"5965","initial":"Y"},{"f":8,"u":0.5,"e":8,"b":0,"s":"扬州","n":"江苏","m":2,"i":0,"money":"5965","initial":"Y"},{"f":8,"u":0.5,"e":8,"b":0,"s":"徐州","n":"江苏","m":2,"i":0,"money":"5965","initial":"X"},{"f":8,"u":0.5,"e":8,"b":0,"s":"泰州","n":"江苏","m":2,"i":0,"money":"5965","initial":"T"},{"f":12,"u":0.5,"e":8,"b":0,"s":"新余","n":"江西","m":2,"i":0,"money":"4678","initial":"X"},{"f":12,"u":1,"e":8,"b":0,"s":"鹰潭","n":"江西","m":2,"i":0,"money":"4678","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"宜春","n":"江西","m":2,"i":0,"money":"4678","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"萍乡","n":"江西","m":2,"i":0,"money":"4678","initial":"P"},{"f":12,"u":0.5,"e":8,"b":0,"s":"上饶","n":"江西","m":2,"i":0,"money":"4678","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"南昌","n":"江西","m":2,"i":0,"money":"4678","initial":"N"},{"f":12,"u":0.5,"e":8,"b":0,"s":"吉安","n":"江西","m":2,"i":0,"money":"4678","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"景德镇","n":"江西","m":2,"i":0,"money":"4678","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"九江","n":"江西","m":2,"i":0,"money":"4678","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"赣州","n":"江西","m":2,"i":0,"money":"4678","initial":"G"},{"f":12,"u":0.5,"e":8,"b":0,"s":"抚州","n":"江西","m":2,"i":0,"money":"4678","initial":"F"},{"f":12,"u":0.5,"e":8,"b":0,"s":"阜新","n":"辽宁","m":2,"i":0,"money":"4668","initial":"F"},{"f":12,"u":0.5,"e":8,"b":0,"s":"抚顺","n":"辽宁","m":2,"i":0,"money":"4668","initial":"F"},{"f":12,"u":0.5,"e":8,"b":0,"s":"丹东","n":"辽宁","m":2,"i":0,"money":"4668","initial":"D"},{"f":12,"u":0.5,"e":8,"b":0,"s":"大连","n":"辽宁","m":2,"i":0,"money":"4668","initial":"D"},{"f":12,"u":0.5,"e":8,"b":0,"s":"朝阳","n":"辽宁","m":2,"i":0,"money":"4668","initial":"C"},{"f":12,"u":0.5,"e":8,"b":0,"s":"鞍山","n":"辽宁","m":2,"i":0,"money":"4668","initial":"A"},{"f":12,"u":0.5,"e":8,"b":0,"s":"本溪","n":"辽宁","m":2,"i":0,"money":"4668","initial":"B"},{"f":12,"u":1,"e":8,"b":0,"s":"葫芦岛","n":"辽宁","m":2,"i":0,"money":"4668","initial":"H"},{"f":12,"u":0.5,"e":8,"b":0,"s":"辽阳","n":"辽宁","m":2,"i":0,"money":"4668","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"锦州","n":"辽宁","m":2,"i":0,"money":"4668","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"沈阳","n":"辽宁","m":2,"i":0,"money":"4668","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"铁岭","n":"辽宁","m":2,"i":0,"money":"4668","initial":"T"},{"f":12,"u":0.5,"e":8,"b":0,"s":"盘锦","n":"辽宁","m":2,"i":0,"money":"4668","initial":"P"},{"f":12,"u":0.5,"e":8,"b":0,"s":"营口","n":"辽宁","m":2,"i":0,"money":"4668","initial":"Y"},{"f":5,"u":0.5,"e":8,"b":0,"s":"通辽","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"T"},{"f":5,"u":0.5,"e":8,"b":0,"s":"乌海","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"W"},{"f":5,"u":0.5,"e":8,"b":0,"s":"乌兰察布","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"W"},{"f":5,"u":0.5,"e":8,"b":0,"s":"呼和浩特","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"H"},{"f":5,"u":0.5,"e":8,"b":0,"s":"呼伦贝尔","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"H"},{"f":5,"u":0.5,"e":8,"b":0,"s":"包头","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"B"},{"f":5,"u":0.5,"e":8,"b":0,"s":"巴彦淖尔","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"B"},{"f":5,"u":0.5,"e":8,"b":0,"s":"赤峰","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"C"},{"f":5,"u":0.5,"e":8,"b":0,"s":"鄂尔多斯","n":"内蒙古","m":2,"i":0,"money":"5089","initial":"E"},{"f":8,"u":1,"e":8,"b":0,"s":"固原","n":"宁夏","m":2,"i":0,"money":"5464","initial":"G"},{"f":8,"u":1,"e":8,"b":0,"s":"吴忠","n":"宁夏","m":2,"i":0,"money":"5464","initial":"W"},{"f":8,"u":1,"e":8,"b":0,"s":"石嘴山","n":"宁夏","m":2,"i":0,"money":"5464","initial":"S"},{"f":8,"u":1,"e":8,"b":0,"s":"银川","n":"宁夏","m":2,"i":0,"money":"5464","initial":"Y"},{"f":8,"u":1,"e":8,"b":0,"s":"中卫","n":"宁夏","m":2,"i":0,"money":"5464","initial":"Z"},{"f":5,"u":1,"e":8,"b":0,"s":"西宁","n":"青海","m":2,"i":0,"money":"5549","initial":"X"},{"f":12,"u":0.5,"e":8,"b":0,"s":"烟台","n":"山东","m":2,"i":0,"money":"5212","initial":"Y"},{"f":20,"u":0.5,"e":8,"b":0,"s":"淄博","n":"山东","m":2,"i":0,"money":"5212","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"枣庄","n":"山东","m":2,"i":0,"money":"5212","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"威海","n":"山东","m":2,"i":0,"money":"5212","initial":"W"},{"f":12,"u":0.5,"e":8,"b":0,"s":"潍坊","n":"山东","m":2,"i":0,"money":"5212","initial":"W"},{"f":12,"u":0.5,"e":8,"b":0,"s":"泰安","n":"山东","m":2,"i":0,"money":"5212","initial":"T"},{"f":12,"u":0.5,"e":8,"b":0,"s":"日照","n":"山东","m":2,"i":0,"money":"5212","initial":"R"},{"f":20,"u":0.5,"e":8,"b":0,"s":"青岛","n":"山东","m":2,"i":0,"money":"5212","initial":"Q"},{"f":12,"u":0.5,"e":8,"b":0,"s":"东营","n":"山东","m":2,"i":0,"money":"5212","initial":"D"},{"f":12,"u":0.5,"e":8,"b":0,"s":"德州","n":"山东","m":2,"i":0,"money":"5212","initial":"D"},{"f":12,"u":0.5,"e":8,"b":0,"s":"滨州","n":"山东","m":2,"i":0,"money":"5212","initial":"B"},{"f":12,"u":0.5,"e":8,"b":0,"s":"菏泽","n":"山东","m":2,"i":0,"money":"5212"},{"f":12,"u":0.5,"e":8,"b":0,"s":"济南","n":"山东","m":2,"i":0,"money":"5212","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"济宁","n":"山东","m":2,"i":0,"money":"5212","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"莱芜","n":"山东","m":2,"i":0,"money":"5212","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"聊城","n":"山东","m":2,"i":0,"money":"5212","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"临沂","n":"山东","m":2,"i":0,"money":"5212","initial":"L"},{"f":6,"u":0.5,"e":8,"b":0,"s":"临汾","n":"山西","m":2,"i":0,"money":"4475","initial":"L"},{"f":6,"u":0.5,"e":8,"b":0,"s":"晋城","n":"山西","m":2,"i":0,"money":"4475","initial":"J"},{"f":12,"u":1,"e":8,"b":0,"s":"晋中","n":"山西","m":2,"i":0,"money":"4475","initial":"J"},{"f":6,"u":0.5,"e":8,"b":0,"s":"吕梁","n":"山西","m":2,"i":0,"money":"4475","initial":"L"},{"f":12,"u":1,"e":8,"b":0,"s":"大同","n":"山西","m":2,"i":0,"money":"4475","initial":"D"},{"f":6,"u":0.5,"e":8,"b":0,"s":"长治","n":"山西","m":2,"i":0,"money":"4475","initial":"C"},{"f":6,"u":0.5,"e":8,"b":0,"s":"太原","n":"山西","m":2,"i":0,"money":"4475","initial":"T"},{"f":6,"u":0.5,"e":8,"b":0,"s":"朔州","n":"山西","m":2,"i":0,"money":"4475","initial":"S"},{"f":12,"u":1,"e":8,"b":0,"s":"运城","n":"山西","m":2,"i":0,"money":"4475","initial":"Y"},{"f":6,"u":0.5,"e":8,"b":0,"s":"阳泉","n":"山西","m":2,"i":0,"money":"4475","initial":"Y"},{"f":6,"u":0.5,"e":8,"b":0,"s":"忻州","n":"山西","m":2,"i":0,"money":"4475","initial":"X"},{"f":12,"u":0.5,"e":8,"b":0,"s":"咸阳","n":"陕西","m":2,"i":0,"money":"4970","initial":"X"},{"f":12,"u":0.5,"e":8,"b":0,"s":"西安","n":"陕西","m":2,"i":0,"money":"4970","initial":"X"},{"f":12,"u":0.5,"e":8,"b":0,"s":"延安","n":"陕西","m":2,"i":0,"money":"4970","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"榆林","n":"陕西","m":2,"i":0,"money":"4970","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"铜川","n":"陕西","m":2,"i":0,"money":"4970","initial":"T"},{"f":12,"u":0.5,"e":8,"b":0,"s":"渭南","n":"陕西","m":2,"i":0,"money":"4970","initial":"W"},{"f":12,"u":0.5,"e":8,"b":0,"s":"商洛","n":"陕西","m":2,"i":0,"money":"4970","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"安康","n":"陕西","m":2,"i":0,"money":"4970","initial":"A"},{"f":12,"u":0.5,"e":8,"b":0,"s":"宝鸡","n":"陕西","m":2,"i":0,"money":"4970","initial":"B"},{"f":12,"u":0.5,"e":8,"b":0,"s":"汉中","n":"陕西","m":2,"i":0,"money":"4970","initial":"H"},{"f":7,"u":0.5,"e":8,"b":0,"s":"上海","n":"上海","m":2,"i":0,"money":"9995"},{"f":12,"u":1,"e":8,"b":0,"s":"攀枝花","n":"四川","m":2,"i":0,"money":"5327","initial":"P"},{"f":12,"u":0.5,"e":8,"b":0,"s":"遂宁","n":"四川","m":2,"i":0,"money":"5327","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"自贡","n":"四川","m":2,"i":0,"money":"5327","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"资阳","n":"四川","m":2,"i":0,"money":"5327","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"雅安","n":"四川","m":2,"i":0,"money":"5327","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"宜宾","n":"四川","m":2,"i":0,"money":"5327","initial":"Y"},{"f":12,"u":0.5,"e":8,"b":0,"s":"德阳","n":"四川","m":2,"i":0,"money":"5327","initial":"D"},{"f":12,"u":0.5,"e":8,"b":0,"s":"广安","n":"四川","m":2,"i":0,"money":"5327","initial":"G"},{"f":12,"u":1,"e":8,"b":0,"s":"广元","n":"四川","m":2,"i":0,"money":"5327","initial":"G"},{"f":12,"u":0.5,"e":8,"b":0,"s":"巴中","n":"四川","m":2,"i":0,"money":"5327","initial":"B"},{"f":12,"u":0.5,"e":8,"b":0,"s":"成都","n":"四川","m":2,"i":0,"money":"5327","initial":"C"},{"f":12,"u":0.5,"e":8,"b":0,"s":"达州","n":"四川","m":2,"i":0,"money":"5327","initial":"D"},{"f":12,"u":0.5,"e":8,"b":0,"s":"泸州","n":"四川","m":2,"i":0,"money":"5327","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"南充","n":"四川","m":2,"i":0,"money":"5327","initial":"N"},{"f":12,"u":0.5,"e":8,"b":0,"s":"内江","n":"四川","m":2,"i":0,"money":"5327","initial":"N"},{"f":12,"u":0.5,"e":8,"b":0,"s":"绵阳","n":"四川","m":2,"i":0,"money":"5327","initial":"M"},{"f":12,"u":0.6,"e":8,"b":0,"s":"眉山","n":"四川","m":2,"i":0,"money":"5327","initial":"M"},{"f":12,"u":0.5,"e":8,"b":0,"s":"乐山","n":"四川","m":2,"i":0,"money":"5327","initial":"L"},{"f":11,"u":1,"e":8,"b":0,"s":"天津","n":"天津","m":2,"i":0,"money":"7192","initial":"T"},{"f":5,"u":0.5,"e":8,"b":0,"s":"乌鲁木齐","n":"新疆","m":2,"i":0,"money":"5312","initial":"W"},{"f":5,"u":0.5,"e":8,"b":0,"s":"克拉玛依","n":"新疆","m":2,"i":0,"money":"5312","initial":"K"},{"f":12,"u":0.6,"e":8,"b":0,"s":"昆明","n":"云南","m":2,"i":0,"money":"5038","initial":"K"},{"f":12,"u":0.6,"e":8,"b":0,"s":"丽江","n":"云南","m":2,"i":0,"money":"5038","initial":"L"},{"f":15,"u":0.6,"e":8,"b":0,"s":"临沧","n":"云南","m":2,"i":0,"money":"5038","initial":"L"},{"f":12,"u":0.6,"e":8,"b":0,"s":"保山","n":"云南","m":2,"i":0,"money":"5038","initial":"B"},{"f":12,"u":0.6,"e":8,"b":0,"s":"思茅","n":"云南","m":2,"i":0,"money":"5038","initial":"S"},{"f":12,"u":1,"e":8,"b":0,"s":"曲靖","n":"云南","m":2,"i":0,"money":"5038","initial":"Q"},{"f":12,"u":0.6,"e":8,"b":0,"s":"玉溪","n":"云南","m":2,"i":0,"money":"5038","initial":"Y"},{"f":12,"u":0.6,"e":8,"b":0,"s":"昭通","n":"云南","m":2,"i":0,"money":"5038","initial":"Z"},{"f":12,"u":0.5,"e":8,"b":0,"s":"舟山","n":"浙江","m":0,"i":0,"money":"6111","initial":"Z"},{"f":12,"u":1,"e":8,"b":0,"s":"衢州","n":"浙江","m":1,"i":0,"money":"6111","initial":"Q"},{"f":12,"u":0.5,"e":8,"b":0,"s":"绍兴","n":"浙江","m":2,"i":0,"money":"6111","initial":"S"},{"f":12,"u":0.5,"e":8,"b":0,"s":"宁波","n":"浙江","m":2,"i":0,"money":"6111","initial":"N"},{"f":12,"u":0.5,"e":8,"b":0,"s":"台州","n":"浙江","m":2,"i":0,"money":"6111","initial":"T"},{"f":12,"u":0.5,"e":8,"b":0,"s":"温州","n":"浙江","m":2,"i":0,"money":"6111","initial":"W"},{"f":12,"u":0.5,"e":8,"b":0,"s":"杭州","n":"浙江","m":2,"i":0,"money":"6111","initial":"H"},{"f":12,"u":0.5,"e":8,"b":0,"s":"丽水","n":"浙江","m":2,"i":0,"money":"6111","initial":"L"},{"f":12,"u":0.5,"e":8,"b":0,"s":"金华","n":"浙江","m":0,"i":0,"money":"6111","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"嘉兴","n":"浙江","m":2,"i":0,"money":"6111","initial":"J"},{"f":12,"u":0.5,"e":8,"b":0,"s":"湖州","n":"浙江","m":2,"i":0,"money":"6111","initial":"H"},{"f":7,"u":1,"e":8,"b":0,"s":"重庆","n":"重庆","m":2,"i":0,"money":"5462","initial":"C"}],
        alpha: '',
        windowHeight: ''
    },
    onLoad(options){
    	var citylist = this.data.citylist;
    	// for(var i = 0;i<city.cityObj.length;i++){
    	// 	for(var j=0;j<ABCArr.length;j++){
			//     if(city.cityObj[i].initial == ABCArr[j]){
			// 	    testArr.push({
			// 		    name : ABCArr[j],
			// 		    city : city.cityObj[i].city
			// 	    });
			//     }
		 //    }
	    // }

	    var list=[],
		    ABCArr = ["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z"];
	    for (var i = 0,len = ABCArr.length; i < len; i++ ) {
	    	list.push({
			    "alphabet" : ABCArr[i],
			    "datas" : []
		    });
		    citylist.forEach(function(val){
			    if (val.initial == ABCArr[i]){
				    list[i].datas.push(val.s)
			    }
		    });
		    // city.cityObj.forEach(function(val){
			 //    citylist.forEach(function(name,i){
				//     if(!(val.city.indexOf(name.s))){
				// 	    citylist[i].initial = val.initial
				//     }
			 //    });
		    // });
	    }
	    this.setData({
		    list : list
	    })

		// console.log(!('安庆市'.indexOf('安庆')))

	    // wx.request({
		 //    url: 'https://www.maxappa.com/api/wage.php',
		 //    data:{
		 //        city : '上海'
		 //    },
		 //    success: function(res) {
		 //    	console.log(res.data);
		 //    }
	    // });

        var res = wx.getSystemInfoSync()
        var t = this;
        this.pixelRatio = res.pixelRatio;
        this.apHeight = 16;
        this.offsetTop = 80;
        this.setData({windowHeight: res.windowHeight + 'px'});
        // const cityObj = city.cityObj;
        // const cityHot = ['北京市','上海市'];
        // const cityA = [],cityB = [],cityC = [],cityD = [],cityE = [],cityF = [],cityG = [],cityH = [],cityI = [],cityJ = [],cityK = [],cityL = [],cityM = [],cityN = [],cityO = [],cityP = [],cityQ = [],cityR = [],cityS = [],cityT = [],cityU = [],cityV = [],cityW = [],cityX = [],cityY = [],cityZ = [];
        // for(var i=0;i<cityObj.length;i++){
        //     switch (cityObj[i].initial) {
        //         case "A":
        //         cityA.push(cityObj[i].city);
        //         break;
        //         case "B":
        //         cityB.push(cityObj[i].city);
        //         break;
        //         case "C":
        //         cityC.push(cityObj[i].city);
        //         break;
        //         case "D":
        //         cityD.push(cityObj[i].city);
        //         break;
        //         case "E":
        //         cityE.push(cityObj[i].city);
        //         break;
        //         case "F":
        //         cityF.push(cityObj[i].city);
        //         break;
        //         case "G":
        //         cityG.push(cityObj[i].city);
        //         break;
        //         case "H":
        //         cityH.push(cityObj[i].city);
        //         break;
        //         case "I":
        //         cityI.push(cityObj[i].city);
        //         break;
        //         case "J":
        //         cityJ.push(cityObj[i].city);
        //         break;
        //         case "K":
        //         cityK.push(cityObj[i].city);
        //         break;
        //         case "L":
        //         cityL.push(cityObj[i].city);
        //         break;
        //         case "M":
        //         cityM.push(cityObj[i].city);
        //         break;
        //         case "N":
        //         cityN.push(cityObj[i].city);
        //         break;
        //         case "O":
        //         cityO.push(cityObj[i].city);
        //         break;
        //         case "P":
        //         cityP.push(cityObj[i].city);
        //         break;
        //         case "Q":
        //         cityQ.push(cityObj[i].city);
        //         break;
        //         case "R":
        //         cityR.push(cityObj[i].city);
        //         break;
        //         case "S":
        //         cityS.push(cityObj[i].city);
        //         break;
        //         case "T":
        //         cityT.push(cityObj[i].city);
        //         break;
        //         case "U":
        //         cityU.push(cityObj[i].city);
        //         break;
        //         case "V":
        //         cityV.push(cityObj[i].city);
        //         break;
        //         case "W":
        //         cityW.push(cityObj[i].city);
        //         break;
        //         case "X":
        //         cityX.push(cityObj[i].city);
        //         break;
        //         case "Y":
        //         cityY.push(cityObj[i].city);
        //         break;
        //         case "Z":
        //         cityZ.push(cityObj[i].city);
        //         break;
        //     }
        // }
        // t.setData({
        //     list : [{
        //         alphabet: 'Top', datas: cityHot
        //     },{
        //         alphabet: 'A', datas: cityA
        //     },{
        //         alphabet: 'B', datas: cityB
        //     },{
        //         alphabet: 'C', datas: cityC
        //     },{
        //         alphabet: 'D', datas: cityD
        //     },{
        //         alphabet: 'E', datas: cityE
        //     },{
        //         alphabet: 'F', datas: cityF
        //     },{
        //         alphabet: 'G', datas: cityG
        //     },{
        //         alphabet: 'H', datas: cityH
        //     },{
        //         alphabet: 'I', datas: cityI
        //     },{
        //         alphabet: 'J', datas: cityJ
        //     },{
        //         alphabet: 'K', datas: cityK
        //     },{
        //         alphabet: 'L', datas: cityL
        //     },{
        //         alphabet: 'M', datas: cityM
        //     },{
        //         alphabet: 'N', datas: cityN
        //     },{
        //         alphabet: 'O', datas: cityO
        //     },{
        //         alphabet: 'P', datas: cityP
        //     },{
        //         alphabet: 'Q', datas: cityQ
        //     },{
        //         alphabet: 'R', datas: cityR
        //     },{
        //         alphabet: 'S', datas: cityS
        //     },{
        //         alphabet: 'T', datas: cityT
        //     },{
        //         alphabet: 'U', datas: cityU
        //     },{
        //         alphabet: 'V', datas: cityV
        //     },{
        //         alphabet: 'W', datas: cityW
        //     },{
        //         alphabet: 'X', datas: cityX
        //     },{
        //         alphabet: 'Y', datas: cityY
        //     },{
        //         alphabet: 'Z', datas: cityZ
        //     }]
        // })
    },
    handlerAlphaTap(e) {
        let {ap} = e.target.dataset;
        this.setData({alpha: ap});
    },
    handlerMove(e) {
        let {list} = this.data;
        let moveY = e.touches[0].clientY;
        let rY = moveY - this.offsetTop;
        if(rY >= 0) {
          let index = Math.ceil((rY - this.apHeight)/ this.apHeight);
          if(0 <= index < list.length) {
            let nonwAp = list[index];
            nonwAp && this.setData({alpha: nonwAp.alphabet});
          }
        }
    },
    handlerCity(e){
        console.log(e.currentTarget.dataset.text);
    }
})
